<!-- terraform-plan-aws_general-purpose-pr-14 -->
## 📝 Terraform Plan for `aws/general-purpose` (PR #14)

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.personal_website will be created
  + resource "aws_acm_certificate" "personal_website" {
      + arn                       = (known after apply)
      + domain_name               = "reon.my.id"
      + domain_validation_options = [
          + {
              + domain_name           = "reon.my.id"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.reon.my.id"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + region                    = "us-east-1"
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "reon.my.id",
          + "www.reon.my.id",
        ]
      + tags                      = {
          + "Name" = "personal-website-cert"
        }
      + tags_all                  = {
          + "Name" = "personal-website-cert"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.personal_website will be created
  + resource "aws_acm_certificate_validation" "personal_website" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
      + region          = "us-east-1"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ current_aws_caller_identity        = {
      ~ arn_without_session = "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-21004375113" -> "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-21005579309"
        # (1 unchanged attribute hidden)
    }
```

</details>

*Workflow run: [`21005579309`](https://github.com/reverseon/ishiori-on-cloud/actions/runs/21005579309)*
